#ifndef MEASUREMENT_H_INCLUDED
#define MEASUREMENT_H_INCLUDED
#include <time.h>

#define measurements_number 28

// Даний модуль містить функції що вимірюють час сортування масива А конкретними алгоритмами
extern clock_t Result[measurements_number]; // масив часу для запису в нього часу роботи конкретних алгоритмів

void MeasurementProcessing(); /* функція для обрахування точного часу роботи конкретного алгоритму
 шляхом відкидання трьох мінімумів та трьох максимумів з масива часу Result, та запису цього часу в
Result[0] */

void Processing_Insert_Sort(int mod1);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №2 методу прямої вставки , яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Select_Sort(int mod1); /* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №8 методу прямого вибору, яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Exchange_Sort(int mod1);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №3 методу прямого обміну, яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Quick_Sort(int mod1);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування Хоара, яка в якості параметрів приймає режим заповнення масивa А */


void Processing_Vector_Insert_Sort(int mod2);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №2 методу прямої вставки , яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Vector_Select_Sort(int mod2); /* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №8 методу прямого вибору, яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Vector_Exchange_Sort(int mod2);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування №3 методу прямого обміну, яка в якості параметрів приймає режим заповнення масивa А */

void Processing_Vector_Quick_Sort(int mod2);/* функція для виклику функцій вимірювання часу роботи алгоритму
сортування Хоара, яка в якості параметрів приймає режим заповнення масивa А */



void Measure_Insert_Sort(int mod1);//функція виміру часу роботи методу прямої
                                                   //вставки з двійковим пошуком місця вставки
void Measure_Select_Sort(int mod1);//функція виміру часу роботи алгоритму вставки №2

void Measure_Exchange_Sort(int mod1); //функція виміру часу роботи сортування обміну

void Measure_Quick_Sort(int mod1);//функція виміру часу роботи алгоритму сортування Хоара



void Measure_Vector_Insert_Sort(int mod2);//функція виміру часу роботи методу прямої
                                                   //вставки з двійковим пошуком місця вставки
void Measure_Vector_Select_Sort(int mod2);//функція виміру часу роботи алгоритму вставки №2

void Measure_Vector_Exchange_Sort(int mod2); //функція виміру часу роботи сортування обміну

void Measure_Vector_Quick_Sort(int mod2);//функція виміру часу роботи алгоритму сортування Хоара



#endif // MEASUREMENT_H_INCLUDED
